In [3]:
%pip install numpy

Requirement already satisfied: numpy in c:\users\sarabenítezhermoso\appdata\local\programs\python\python311\lib\site-packages (2.1.1)Note: you may need to restart the kernel to use updated packages.

In [2]:
%pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp311-cp311-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.23.2 in c:\users\sarabenítezhermoso\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.1.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\sarabenítezhermoso\appdata\roaming\python\python311\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\sarabenítezhermoso\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.3-cp311-cp311-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.6 MB 3.4 MB/s eta 0:00:04
   ---- ----------------------------------- 1.3/11.6 MB 3.5 MB/s eta 0:00:03
   ------ --------------------------------- 1.8/11.6 MB 3.5 MB/s eta 0:00:03
   -------- ------------------------------- 2.4/11.6 MB 3.4 MB/s eta 0:00:03
   --------- ------------------------------ 2.9/11.6 MB 3.0 MB/s eta 0:00:03
   ---------- ----------------------------- 3.1/11.6 MB 3.0 MB/s eta 0:00:03
   ------------ --------------------------- 3.7/11.6 MB 2.6 MB/s eta 0:00:04
   -------------- ------------------------- 4.2/11.6 MB 2.5 MB/s eta 0:00:04
   --------------- ------------------------ 4.5/11.6 MB 2.4 MB/s eta 0:00:03
   ----------------- ---------------------- 5.0/11.6 MB 2.4 MB/s eta 0:00:03
   ------------------ --------------------- 5.2/11.6 MB 2.4 MB/s eta 0:00:03
   ------------------- -------------------- 5.8/11.6 MB 2.3 MB/s eta 0:00:03
   ---------------------- ----------------- 6.6/11.6 MB 2.4 MB/s eta 0:00:03
   ------------------------ --------------- 7.1/11.6 MB 2.4 MB/s eta 0:00:02
   -------------------------- ------------- 7.6/11.6 MB 2.5 MB/s eta 0:00:02
   --------------------------- ------------ 8.1/11.6 MB 2.4 MB/s eta 0:00:02
   ------------------------------ --------- 8.9/11.6 MB 2.5 MB/s eta 0:00:02
   --------------------------------- ------ 9.7/11.6 MB 2.5 MB/s eta 0:00:01
   ----------------------------------- ---- 10.2/11.6 MB 2.6 MB/s eta 0:00:01
   -------------------------------------- - 11.3/11.6 MB 2.6 MB/s eta 0:00:01
   ---------------------------------------  11.5/11.6 MB 2.6 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 2.5 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd
import numpy as np

In [6]:
df= pd.read_csv(r"data/ds_salaries.csv")

In [7]:
df.head(3)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

In [8]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [9]:
df.shape

(3755, 11)

siempre que veams un objeto  en un str

In [10]:
df.dtypes

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object

In [11]:
df.isnull(). sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [12]:
df.duplicated().sum()

np.int64(1171)

In [16]:

duplicados=pd.DataFrame(df.value_counts())
duplicados[duplicados['count']>1]

                                                                                                                                                                    count
work_year experience_level employment_type job_title            salary salary_currency salary_in_usd employee_residence remote_ratio company_location company_size
2022      SE               FT              Data Scientist       191475 USD             191475        US                 100          US               M                21
                                                                141525 USD             141525        US                 100          US               M                21
2023      SE               FT              Data Engineer        252000 USD             252000        US                 0            US               M                13
                                                                129000 USD             129000        US                 0            US               M                13
2022      SE               FT              Data Engineer        130000 USD             130000        US                 0            US               M                12
...                                                                                                                                                                   ...
                                           Data Scientist       119300 USD             119300        US                 0            US               L                 2
2023      SE               FT              Data Quality Analyst 100000 USD             100000        US                 0            US               M                 2
                                                                80000  USD             80000         US                 0            US               M                 2
2022      EN               FT              Data Analyst         50000  USD             50000         US                 50           US               L                 2
2023      MI               FT              Data Analyst         85000  USD             85000         US                 0            US               M                 2

[544 rows x 1 columns]

In [19]:
df.drop_duplicates(inplace=True)